netify-soap/src/test/resources/soap/requests/genre/DeleteGenreRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:DeleteGenreRequest>
            <gen:id>1</gen:id>
        </gen:DeleteGenreRequest>
    </soapenv:Body>
</soapenv:Envelope>